## Criando tabelas e inserindo dados dentro do  banco de dados

*    TB_CLIENTES-dados dos clientes(nome_cliente, endereco_cliente, cidade_cliente, estado_cliente)

*    TB_PEDIDOS-dados dos pedidos(id_pedido, id_cliente, id_vendedor, data_pedido, produto, id_entrega)

*    TB_VENDEDOR-dados dos vendedores(id_vendedor, nome_vendedor)

In [ ]:
cnn= sqlite3.connect('D:/SQL/livraria.db1.0')
cursor=cnn.cursor()

cursor.execute('''
    CREATE TABLE IF NOT EXISTS TB_CLIENTES (
        id_cliente INTEGER PRIMARY KEY AUTOINCREMENT,
        nome_cliente TEXT,
        endereco_cliente TEXT,
        cidade_cliente TEXT,
        estado_cliente TEXT
    );
''')


cursor.execute("INSERT INTO TB_CLIENTES (nome_cliente, endereco_cliente, cidade_cliente, estado_cliente) VALUES(?, ?, ?, ?)",
               ("Maria Lurdes", "Rua 62", "Fortaleza", "CE"))

cursor.execute("INSERT INTO TB_CLIENTES (nome_cliente, endereco_cliente, cidade_cliente, estado_cliente) VALUES(?, ?, ?, ?)",
               ("Ronaldo Lima", "Rua 12", "Campinas", "SP"))

cursor.execute("INSERT INTO TB_CLIENTES (nome_cliente, endereco_cliente, cidade_cliente, estado_cliente) VALUES(?, ?, ?, ?)",
               ("Frank Dill", "Rua Principal", "Rio de Janeiro", "RJ"))

cursor.execute("INSERT INTO TB_CLIENTES (nome_cliente, endereco_cliente, cidade_cliente, estado_cliente) VALUES(?, ?, ?, ?)",
               ("Guilherme Sousa", "Rua 1", "Campos", "RJ"))

cursor.execute("INSERT INTO TB_CLIENTES (nome_cliente, endereco_cliente, cidade_cliente, estado_cliente) VALUES(?, ?, ?, ?)",
               ("Lady Jhow", "Rua 99", "Porto Alegre", "RS"))

cursor.execute("INSERT INTO TB_CLIENTES (nome_cliente, endereco_cliente, cidade_cliente, estado_cliente) VALUES(?, ?, ?, ?)",
               ("Caio Dimas", "Rua L", "Porto Alegre", "RS"))

cursor.execute("INSERT INTO TB_CLIENTES (nome_cliente, endereco_cliente, cidade_cliente, estado_cliente) VALUES(?, ?, ?, ?)",
               ("Joao Pedro", "Rua 2", "Itacare", "BA"))

cursor.execute("INSERT INTO TB_CLIENTES (nome_cliente, endereco_cliente, cidade_cliente, estado_cliente) VALUES(?, ?, ?, ?)",
               ("Guilherme F", "SQS 202", "Brasilia", "DF"))

cursor.execute("INSERT INTO TB_CLIENTES (nome_cliente, endereco_cliente, cidade_cliente, estado_cliente) VALUES(?, ?, ?, ?)",
               ("Gabriel F", "SQS 212", "Brasilia", "DF"))

cursor.execute("INSERT INTO TB_CLIENTES (nome_cliente, endereco_cliente, cidade_cliente, estado_cliente) VALUES(?, ?, ?, ?)",
               ("Alceu", "Quadra 2", "Ceilandia", "DF"))

cursor.execute('''
    CREATE TABLE IF NOT EXISTS TB_PEDIDOS (
        id_pedido INTEGER PRIMARY KEY,
        id_cliente INTEGER NULL,
        id_vendedor INTEGER NULL,
        data_pedido DATETIME NULL,
        produto TEXT NULL,
        id_entrega INTEGER NULL
    )
''')

from datetime import datetime
now = datetime.now().strftime('%Y-%m-%d %H:%M:%S')

cursor.execute("INSERT INTO TB_PEDIDOS (id_pedido, id_cliente, id_vendedor, data_pedido, produto, id_entrega) VALUES(?, ?, ?, ?, ?, ?)",
               (1001, 1, 5, now, 'livro', 23))

cursor.execute("INSERT INTO TB_PEDIDOS (id_pedido, id_cliente, id_vendedor, data_pedido, produto, id_entrega) VALUES(?, ?, ?, ?, ?, ?)",
               (1002, 1, 7, now, 'jogo', 24))

cursor.execute("INSERT INTO TB_PEDIDOS (id_pedido, id_cliente, id_vendedor, data_pedido, produto, id_entrega) VALUES(?, ?, ?, ?, ?, ?)",
               (1003, 2, 5, now, 'livro', 23))

cursor.execute("INSERT INTO TB_PEDIDOS (id_pedido, id_cliente, id_vendedor, data_pedido, produto, id_entrega) VALUES(?, ?, ?, ?, ?, ?)",
               (1004, 4, 3, now, 'vale', 25))

cursor.execute("INSERT INTO TB_PEDIDOS (id_pedido, id_cliente, id_vendedor, data_pedido, produto, id_entrega) VALUES(?, ?, ?, ?, ?, ?)",
               (1005, 9, 5, now, 'livro', 26))

cursor.execute('''
    CREATE TABLE IF NOT EXISTS TB_VENDEDOR (
        id_vendedor INTEGER PRIMARY KEY,
        nome_vendedor TEXT NULL
    );
''')


cursor.execute("INSERT INTO TB_VENDEDOR (id_vendedor, nome_vendedor) VALUES (?, ?)",
               (1, 'Rafael'))

cursor.execute("INSERT INTO TB_VENDEDOR (id_vendedor, nome_vendedor) VALUES (?, ?)",
               (2, 'Carlos'))

cursor.execute("INSERT INTO TB_VENDEDOR (id_vendedor, nome_vendedor) VALUES (?, ?)",
               (3, 'Chico'))

cursor.execute("INSERT INTO TB_VENDEDOR (id_vendedor, nome_vendedor) VALUES (?, ?)",
               (4, 'Fabiana'))

cursor.execute("INSERT INTO TB_VENDEDOR (id_vendedor, nome_vendedor) VALUES (?, ?)",
               (5, 'Luiza'))

cursor.execute("INSERT INTO TB_VENDEDOR (id_vendedor, nome_vendedor) VALUES (?, ?)",
               (6, 'Breno'))

cursor.execute("INSERT INTO TB_VENDEDOR (id_vendedor, nome_vendedor) VALUES (?, ?)",
               (7, 'Vinicius'))

# Realizar o commit das alterações
cnn.commit ()
cnn.close ()